# StartOrBottomExtensionStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..StartOrBottomExtensionStyle Property
ContinuousRailType Class See Also
---
The extension style of the rail termination at the beginning or bottom.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RailExtensionStyle StartOrBottomExtensionStyle { get; set; }
```

Visual Basic
---
```text
Public Property StartOrBottomExtensionStyle As RailExtensionStyle
	Get
	Set
```

Visual C++
---
```text
public:
property RailExtensionStyle StartOrBottomExtensionStyle {
	RailExtensionStyle get ();
	void set (RailExtensionStyle value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace